[M_BearerBadNews MissionDefinition]
MissionName="bad news recipient"
MissionDescription="Good Jack kills Roland. To local and foreign friends [place]holy place[-place], They still don't know. Mordechai calls it bad news. "
TurnInDescription="Roland's friends mourn his death and all have one dream. It is cruel revenge.."
MissionSummary="Roland's friends reported his death."
MissionGiver="Mordecai"
MissionTurnInLocation="Mordecai"
TeaserText="What Roland's friend wanted to know."

[M_BearerBadNews:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BearerBadNews:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BearerBadNews:OpenArmory MissionObjectiveDefinition]
ProgressMessage="Open Roland's Arsenal"

[M_BearerBadNews:OpenArmorySet MissionObjectiveSetDefinition]
MissionSummaryOverride="Open Roland Tools.."
MissionDescriptionOverride="After telling Roland's friends about his death, Mordecai believes he has inherited his dead friend's weapon. It provides codes to store and delete items."

[M_BearerBadNews:OpenChest MissionObjectiveDefinition]
ProgressMessage="Open the gun case"

[M_BearerBadNews:TalkBrick MissionObjectiveDefinition]
ProgressMessage="Talk to the brick."

[M_BearerBadNews:TalkMarcus MissionObjectiveDefinition]
ProgressMessage="talk to Marcus"

[M_BearerBadNews:TalkMoxxie MissionObjectiveDefinition]
ProgressMessage="Refer to Mxxi"

[M_BearerBadNews:TalkScooter MissionObjectiveDefinition]
ProgressMessage="A few words about the scooter"

[M_BearerBadNews:TalkTannis MissionObjectiveDefinition]
ProgressMessage="Talk to Thanis"

[M_BearerBadNews:TalkZed MissionObjectiveDefinition]
ProgressMessage="Talk to Z"

